{
  "Date/Time Tools": "日期/时间操作",
  "Field Extractor": "字段信息提取",
  "ID Info Extractor": "身份证信息提取",
  "JSON Parser": "Json 解析器",
  "Phone Location Lookup": "手机号归属地查询",
  "Code Scanner": "二维码/条形码解析",
  "Template Renderer": "模板渲染",
  "Web to Attachment": "网页转附件",
  "AriaLink Batch Downloader": "AriaLink 批量下载器",
  "PhoneticsMate": "音标伴侣",
  "RandomRecord": "随机记录生成器",
  "This plugin offers convenient date and time manipulation functions, allowing flexible formatting, performing addition and subtraction operations with dates, and even converting text dates into date fields. It also allows direct setting of time attributes like hour, minute, and second, streamlining time handling for greater convenience and efficiency.": "这个插件提供了便捷的日期和时间操作功能，能够灵活地对日期进行格式化，执行加减操作，甚至将文本日期转换成日期字段。它还允许直接统一设置时分秒等时间属性，让时间处理更加方便和高效。",
  "This plugin easily extracts desired attributes from various fields—whether it's link fields for links/text, personnel fields for ID/name/email, or attachment fields for type/size—streamlining information processing workflows.": "这款插件让你轻松从不同字段中提取所需属性。无论是链接字段的链接/文本、人员字段的id/name/email还是附件字段的type/size，都能快速提取出来，简化了信息处理流程。",
  "By inputting an ID card number, this plugin intelligently extracts information such as age, gender, date of birth, zodiac sign, Chinese zodiac, and native place. This smart identification greatly simplifies the handling of ID card information.": "根据身份证号码，这个插件能够智能地提取出年龄、性别、出生年月、星座、生肖以及籍贯等信息。这种智能识别功能大大简化了对身份证信息的处理。",
  "This parser intelligently interprets data from JSON strings, allocating data to corresponding cells based on key-value pairs or array sequences. Such functionality makes handling complex JSON data easy and efficient.": "这款解析器能够根据 JSON 字符串智能地解析数据，根据键值对或者数组顺序将数据分配到对应的单元格中。这样的功能使得处理复杂的 JSON 数据变得轻松高效。",
  "This plugin effortlessly retrieves location and carrier information based on a mobile phone number. This querying function allows quick access to associated information behind the phone number.": "通过手机号码，这个插件能够轻松获取到归属地以及运营商等信息。这样的查询功能让你快速了解手机号背后的关联信息。",
  "This plugin identifies and decodes QR codes/barcodes within attachments, supporting camera invocation as a scanner. It offers multiple ways for users to decode, enhancing flexibility in content interpretation.": "这款插件可以识别附件中的二维码/条形码，并将其解析为对应的内容。另外，它还支持调用摄像头充当扫码枪，为用户提供了多种解析方式。",
  "Template rendering is a powerful tool that automatically passes field values to templates for flexible rendering. Supporting pipeline symbols allows users to perform advanced operations easily, enabling highly customized data processing.": "模板渲染是一个强大的工具，能够自动传递字段值到模板并进行灵活的渲染。通过支持管道符号，用户可以轻松执行高级操作，从而以一种非常自定义的方式处理数据。",
  "This powerful plugin easily converts web pages into images and uploads them as preview images in attachments. This convenient conversion method provides users with more display options.": "这个功能强大的插件可以轻松将网页保存为图片，并作为预览图上传到附件中。这种便捷的转换方式为用户提供了更多的展示选择。",
  "AriaLink Batch Downloader is a powerful plugin that allows users to efficiently perform batch file downloads using Aria2. Leveraging the advantages of Aria2, users can download multiple files faster and more conveniently.": "AriaLink 批量下载器是一个强大的插件，允许用户使用 Aria2 来进行高效的批量文件下载操作。利用 Aria2 的优势，用户可以更快速、更便捷地下载多个文件。",
  "PhoneticsMate is a convenient tool that converts English text into phonetic symbols and provides pronunciation previews in both American and British phonetic notation. Users can click on the symbols to listen to their pronunciation, effectively enhancing accuracy in English learning and communication.": "PhoneticsMate（音标伴侣）是一个方便的工具，能够将英语文本转换为音标，并提供美式和英式音标的发音预览功能。用户可以通过点击音标来聆听其发音，有效提高英语学习和交流的准确性。",
  "RandomRecord is a practical tool designed to test plugin performance, allowing bulk generation of random records containing data for various fields. Users can customize field types and quantities as needed, facilitating performance testing and data simulation.": "RandomRecord Generator（随机记录生成器）是一个旨在测试插件性能的实用工具，能够批量生成包含任意字段数据的随机记录。用户可根据需求自定义字段类型和数量，用于性能测试和数据模拟。",
  "NotSupport": "不支持",
  "Text": "文本",
  "Number": "数字",
  "SingleSelect": "单选",
  "MultiSelect": "多选",
  "DateTime": "日期时间",
  "Checkbox": "复选框",
  "User": "用户",
  "Phone": "电话号码",
  "Url": "链接",
  "Attachment": "附件",
  "SingleLink": "单向引用",
  "Lookup": "Lookup",
  "Formula": "公式",
  "DuplexLink": "双向引用",
  "Location": "地点",
  "GroupChat": "群聊",
  "Denied": "Denied",
  "CreatedTime": "创建时间",
  "ModifiedTime": "修改时间",
  "CreatedUser": "创建用户",
  "ModifiedUser": "修改用户",
  "AutoNumber": "自动编号",
  "Barcode": "Barcode",
  "Progress": "Progress",
  "Currency": "货币",
  "Rating": "评分",
  "Audit": "审核中",
  "ID card information extraction(China)": "身份证信息提取",
  "Select Data Table": "选择数据表",
  "Select ID field": "选择身份证字段",
  "Select output format": "选择输出格式",
  "Select Output Field": "选择输出字段",
  "Start Extraction": "开始提取",
  "Initializing~~": "正在初始化~~",
  "Step 1 - Getting Table": "第一步-获取表格中",
  "Step 2 - Getting Records": "第二步-获取记录中",
  "Start": "开始",
  "Record": "记录",
  "Update field data": "更新字段信息",
  "initializing": "初始化中·",
  "ID card format error": "身份证格式错误",
  "gender": "性别",
  "birthday": "出生日期",
  "province": "省",
  "area": "区县",
  "adreass": "籍贯",
  "city": "市",
  "age": "年龄",
  "zodiac": "生肖",
  "constellation": "星座",
  "Join the feedback group": "加入反馈群",
  "Select action field": "选择操作字段",
  "Select action": "选择操作",
  "Select date format": "选择日期格式",
  "Time setting operation": "时间设置操作",
  "File configuration": "文件配置",
  "Download configuration": "下载配置",
  "Aria configuration": "Aria2配置",
  "Aria state": "Aria状态",
  "Step 3 - Extraction Started, Please Be Patient": "第三步-开始提取，请耐心等待",
  "Select the date format, which can be entered manually. For the format, please refer to the document ": "选择日期格式，可手动输入，格式请参考文档 ",
  "years": "年",
  "months": "月",
  "weeks": "周",
  "days": "日",
  "year": "年",
  "month": "月",
  "week": "周",
  "day": "日",
  "date": "日",
  "hours": "时",
  "minutes": "分",
  "seconds": "秒",
  "format": "格式化",
  "add-subtract": "加减",
  "text to time": "文本转时间",
  "settings": "设置",
  "Time addition and subtraction operations": "时间加减操作",
  "Optional operations and output fields will automatically calculate the difference (the first record shall prevail)": "可选择操作和输出字段将自动计算差值（首条记录为准）",
  "Powerful date/time manipulation plugin": "强大的日期/时间操作插件",
  "Allows operations such as adding or subtracting any time to the time field, formatting output, etc.": "允许在时间字段上加减任意时间，格式化输出等操作",
  "Select Extraction Field": "选择提取字段",
  "Select Extraction Attribute": "选择提取属性",
  "Select Separator": "选择分隔符",
  "Line Break": "换行符",
  "Space": "空格",
  "Tab": "制表符",
  "Easily extract information from fields into text fields": "轻松的将字段内的信息提取到文本字段中",
  "Check the location of mobile phone number": "手机号查询归属地",
  "1. The public third-party API will be used for query (domestic registration is preferred)<br> 2. Query failure will be empty<br> 3. The data is for reference only, non-operator interface": "1.将使用公共第三方api(国内备案优先)进行查询<br>2.查询失败为空<br>3.数据仅供参考，非运营商接口",
  "Select URL Field": "选择Url字段",
  "Start Parsing": "开始解析",
  "Step 3 - Parsing Started, Please Be Patient": "第三步-开始解析，请耐心等待",
  "Province/City (Carrier)": "省份城市(运营商)",
  "Province/City": "省份城市",
  "Province": "省份",
  "City": "城市",
  "Carrier": "运营商",
  "Card Type": "卡类型",
  "Select PhoneNumber field": "选择手机号字段",
  "Select QR Code / Barcode Attachment Field": "选择二维码/条形码附件字段",
  "Select the attributes that need to be extracted. If there are no attributes in the table, they can be entered manually. Some fields have no attributes that can be extracted": "选择需要提取的属性，如果表中没有可手动输入，部分字段无属性可提取",
  "Select the delimiter for multi-line text, which can be entered manually. \n\\n is a newline, \\t is a tab character": "选择多行文本的分隔符，可手动输入。\n\\n为换行，\\t为制表符",
  "Select Source Field": "选择源字段",
  "Select Url Field": "选择链接字段",
  "Template Rendering": "模板渲染",
  "1.Wrap field names with {'{'}{'{'} and {'}'}{'}'} to automatically generate corresponding text<br/>2.Supports pipeline like {'{'}{'{'} username {'|'} append: \", welcome to LiquidJS!\" {'|'} capitalize{'}'}{'}'}, for more syntax, please see https://liquidjs.com/": "1.使用 {'{'}{'{'} 和 {'}'}{'}'} 将字段名包裹起来，将自动生成对应文本<br/>2.支持管道符如{'{'}{'{'} username {'|'} append: \", welcome to LiquidJS!\" {'|'} capitalize{'}'}{'}'},更多语法请查看 https://liquidjs.com/",
  "Select View": "选择视图",
  "Parse": "解析",
  "Copy as Object": "复制为对象",
  "Copy as Array": "复制为数组",
  "Array Length Error": "数组长度错误",
  "Not in JSON Format": "不符合JSON格式",
  "Unknown Cell Error": "单元格未知错误",
  "Cell Type Error": "单元格类型错误",
  "Cell Not Editable": "单元格不可编辑",
  "Copy Successful": "复制成功",
  "Step 1 - Get the data table": "第一步-获取数据表",
  "Step 2 - Get the record list": "第二步-获取记录列表",
  "Cell": "单元格",
  "Update view data": "更新视图数据",
  "json parser": "Json 解析器",
  "Supports parsing objects & arrays into respective cells. Array length and output length must match. Provide timestamps for date fields instead of strings. Refer to documentation for more field details.": "支持对象&数组解析到对应单元格，数组长度和输出长度必须一样，日期字段需要提供时间戳而非字符串，更多其他字段参考文档",
  "Select Input Field": "选择输入字段",
  "Easily convert QR code / barcode attachments into text or use the camera as a scanner": "将二维码/条形码附件轻松转换成文本，或者调用摄像头充当扫码枪",
  "Using the camera will automatically create a record, supporting copying specific records and overwriting content (not yet implemented)": "1.如果有多个附件将自动换行<br>2.调用摄像头将自动创建记录，支持复制指定记录只覆盖内容(暂未实现)",
  "Select Download file name": "选择下载文件名",
  "Select Download file": "选择下载文件",
  "file name": "文件名",
  "refresh": "刷新",
  "Invalid, refresh method not defined": "无效，刷新方法未定义",
  "There is no data. There is a high probability that the field type has been filtered. Please check whether there are related types.": "没有数据，大概率对字段类型进行了筛选，请检查是否有相关类型",
  "Input can not be empty": "输入不能为空",
  "Output can not be empty": "输出不能为空",
  "View can not be empty": "视图不能为空"
}